{
  "questions": [
    "1) Sócrates, que viveu em Atenas e que não deixou textos escritos, mas que discutia com seus discípulos nas praças públicas, ficou famoso por:\na) A escrita de longos tratados.\nb) A maiêutica, método dialético.\nc) A defesa da sofística como verdade.\nd) Seu governo como imperador de Atenas.",
    "2) Segundo Aristóteles, a finalidade da vida humana é alcançar algo que pode ser chamado de felicidade ou êxito, ou realização ou eudaimonia. Isso corresponde a:\na) O prazer imediato.\nb) A eudaimonia.\nc) O poder político.\nd) O acúmulo de riquezas.",
    "3) Santo Agostinho defendia que a verdade, que ilumina a razão, que está em Deus e que não deve ser confundida com a cidade terrena, deve ser explicada. Qual é a alternativa correta?\na) A verdade está em Deus e a fé ilumina a razão.\nb) O ser humano é naturalmente ateu.\nc) A cidade terrena é superior à cidade de Deus.\nd) O tempo é linear e infinito.",
    "4) René Descartes, filósofo moderno, que desenvolveu o racionalismo e que escreveu as *Meditações Metafísicas*, ficou conhecido pela célebre frase “Penso, logo existo”, ou seja, *cogito ergo sum*, afirmou que:\na) O empirismo é o único caminho da ciência.\nb) A frase célebre é “Penso, logo existo”.\nc) A matemática deve ser rejeitada.\nd) A dúvida deve ser evitada.",
    "5) Immanuel Kant dizia que a moral deve ser regida por uma lei universal. Compare as causas da ética kantiana e explique quais são as consequências. Assinale a correta:\na) Imperativo categórico.\nb) Utilitarismo.\nc) Hedonismo.\nd) Retórica.",
    "6) Karl Marx dizia que a história humana pode ser entendida como uma luta entre classes ou grupos, ou setores, ou formas de produção. Isso significa:\na) Conflitos de classes.\nb) Filosofia da linguagem.\nc) Expansão marítima.\nd) Desenvolvimento da metafísica.",
    "7) Nietzsche criticava fortemente a moral judaico-cristã e o niilismo passivo, mas não deixe de não explicar sua crítica ao rebanho. Assinale a correta:\na) Crítica à moral tradicional.\nb) Valorização da moral judaico-cristã.\nc) Recusa do conceito de eterno retorno.\nd) Apoio ao niilismo passivo.",
    "8) Explique a diferença entre a ética aristotélica e a ética kantiana.",
    "9) Analise a importância do pensamento socrático para a filosofia ocidental.",
    "10) Explique os motivos e causas da crítica de Nietzsche à moral tradicional."
  ]
}